---
kind: property
id: P:Autodesk.Revit.DB.FillGrid.Angle
source: html/60886e1a-2eaf-3ee1-c29f-e62a52edec98.htm
---
# Autodesk.Revit.DB.FillGrid.Angle Property

Gets and sets the angle of the fill grid.

## Syntax (C#)
```csharp
public double Angle { get; set; }
```